module.exports.config = {
		name: "الساعة",
		version: "1.4",
		author: "محمد تانجيرو",
		countDown: 5,
		role: 0,
		description: { ar: "تذكير بالوقت في كل ساعة" },
		category: "box chat",
		guide: { ar: "تعمل أوتوماتيكي، لا تحتاج لكتابة الأمر" }
	                },
const nam = [
{
timer: '12:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 00:00\nبتوقيت السعودية: 02:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '1:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 01:00\nبتوقيت السعودية: 03:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '2:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 02:00\nبتوقيت السعودية: 04:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '3:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 03:00\nبتـوقيـت السعـوديـة: 05:00\nبتوقيـت سـوريـا: 05:00 ⏳\n\n  وقـــت أذڪـــار الصـبـــاح  \nبتـوقيـت سـوريـا وضـواحيـها\n\n♡────ا •💜• ا────♡']
},
{
timer: '4:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 04:00\nبتـوقيـت السعـوديـة: 06:00\nبتوقيـت السـودان: 05:00 ⏳\n\n   وقـــت أذڪـــار الصـبـــاح   \nبتوقيـت السـودان وضواحيـها\n\n♡────ا •💜• ا────♡']
},
{
timer: '5:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 05:00\nبتوقيت السعودية: 07:00 ⏳\n\n   وقـــت أذڪـــار الصـبـــاح\nبتـوقيـــت المـغـــرب العـربـــي\n\n♡────ا •💜• ا────♡']
},
{
timer: '6:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 06:00\nبتوقيت السعودية: 08:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '7:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 07:00\nبتوقيت السعودية: 09:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '8:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 08:00\nبتوقيت السعودية: 10:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '9:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 09:00\nبتوقيت السعودية: 11:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '10:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 10:00\nبتوقيت السعودية: 12:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '11:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 11:00\nبتوقيت السعودية: 13:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '12:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 12:00\nبتوقيت السعودية: 14:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '1:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 13:00\nبتوقيت السعودية: 15:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '2:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 14:00\nبتوقيت السعودية: 16:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '3:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 15:00\nبتوقيت السعودية: 17:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '4:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 16:00\nبتوقيت السعودية: 18:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '5::00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 17:00\nبتوقيت السعودية: 19:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '6:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 18:00\nبتوقيت السعودية: 20:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '7:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 19:00\nبتوقيت السعودية: 21:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '8:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 20:00\nبتوقيت السعودية: 22:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '9:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 21:00\nبتوقيت السعودية: 23:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '10:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 22:00\nبتوقيت السعودية: 00:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '11:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 23:00\nبتوقيت السعودية: 01:00 ⏳\n\n♡────ا •💜• ا────♡']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+3600000).toLocaleString().split(/,/).pop().trim())) allThreads.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.onStart = o => {const allThreads = await threadsData.getAll()};
