module.exports.config = {
                  name: "الساعة",
		  aliases: ["التوقيت"],
		  version: "1.1",
	          author: "محمد تانجيرو",
		  countDown: 5,
		  role: 0,
		  description: { ar: "يرسل رسالة كل ساعة بشكل أتوماتيكي" },
		  category: "games",
		  guide: { ar: ""},
                        };
const nam = [
{
timer: '12:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 00:00\nبتوقيت السعودية: 02:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '1:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 01:00\nبتوقيت السعودية: 03:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '2:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 02:00\nبتوقيت السعودية: 04:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '3:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 03:00\nبتـوقيـت السعـوديـة: 05:00\nبتوقيـت سـوريـا: 05:00 ⏳\n\n  وقـــت أذڪـــار الصـبـــاح  \nبتـوقيـت سـوريـا وضـواحيـها\n\n♡────ا •💜• ا────♡']
},
{
timer: '3:00:03 AM',
message: ['🌹✨ أذڪـــار الصـبـــاح ✨🌹']
},{
timer: '3:00:06 AM',
message: ['🌹 آية الكرسي مرة واحدة 🌹\n\n🌹 سـورة الإخـلاص، الفـلـق،\n   الناس 3 مرات لكل سورة 🌹']
},
{
timer: '3:00:15 AM',
message: ['أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله،\nوَالحَـمـدُ للـه، لا إلـهَ إلاّ اللّـهُ\nوَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ\nولـهُ الحَـمْـد، وهُـوَ علـى كلّ\nشَيءٍ قدير، رَبِّ أسْأَلُـكَ خَيرَ\nمـا في هـذا اليوم وَخَـيرَ مـا\nبَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما\nفي هـذا اليوم وَشَرِّ ما بَعْـدَه،\nرَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ\nالْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ\nفـي النّـارِ وَعَـذابٍ في القَـبْر.\n ༺ا-🌹━━♡━━🌹-ا༻  \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '3:00:25 AM',
message: ['اللّهُمَّ بِكَ أَصـبَحْنا وَبِكَ أَمْسَينا،\nوَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ\nالنُّـشُــور.\n\nاللّهُـمَّ ما أَصْبَـَحَ بي مِنْ نِعْمَةٍ أَو\nبِأَحَدٍ مِـنْ خَلْقِك، فَمِـنْكَ وَحْدَكَ\nلا شريكَ لَـك، فَلَـكَ الْحَمْدُ وَلَـكَ\nالشُّـكْـــر.\n  ༺ا-🌹━━♡━━🌹-ا༻  \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '3:00:35 AM',
message: ['اللّهـمَّ أَنْتَ رَبِّـي لا إلـهَ إلاّ أَنْتَ،\nخَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى\nعَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت،\nأَعـوذُ بِـكَ مِـنْ شَـرِّ ما صَنَـعْت،\nأَبـوءُ لَكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ\nبِذَنْبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ\nالذُّنـوبَ إِلاّ أَنْتَ.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹']
},
{
timer: '3:00:45 AM',
message: ['اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَالعافِيةَ\nفي الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّي\nأسْأَلُكَ العَفْوَ وَالعافِيةَ في ديني\nوَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ\nاسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي،\nاللّهُـمَّ احْفَظْـني مِـن بَـينِ يَدَيَّ\nوَمِن خَلْفـي وَعَن يَمـيني وَعَن\nشِمـالي، وَمِـن فَوْقـي، وَأَعـوذُ\nبِعَظَمَتِكَ أَن أُغْـتالَ مِن تَحْتي.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '3:00:55 AM',
message: ['اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ\nفاطِـرَ السّماواتِ وَالأرْضِ رَبَّ\nكـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ\nلا إِلـهَ إِلاّ أَنْـت، أَعـوذُ بِـكَ مِـن\nشَرِّ نَفْسي وَمِن شَرِّ الشَّيْطانِ وَ\nشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلى نَفْسي\nسـوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِـم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '3:01:05 AM',
message: ['يَـا حَـيُّ يَـا قـيُّـومُ بِـرَحْـمَـتِـكَ\nأسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَ\nلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ.\n\nأَصْبَحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَ\nعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ\nنَبِيِّـنَـا مُحَمَّـدٍ صَلَّـى اللـهُ عَلَيْـهِ\nوَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ\nحَـنِيـفـاً مُسْـلِـماً وَمَـا كَـانَ مِـنَ\nالمُشْرِكِينَ.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '3:01:15 AM',
message: ['اللَّهُـمَّ إِنِّـي أَسْـأَلُكَ عِلْمًا نَافِعًـا،\nوَرِزْقًـا طَـيِّبًا، وَعَمَـلًا مُتَـقَبَّـلًا.\n\nأصْبَـحْـنا وَأَصْبَـحْ المُـلـكُ للـهِ\nرَبِّ العالَمين، اللّهُمَّ إِنِّي أسْأَلُكَ\nخَيْرَ هذا الـيَوْم؛ فَتْحَهُ وَنَصْرَهُ\nوَنـورَهُ وَبَـرَكَتَـهُ وَهُداهُ، وَأَعوذُ\nبِكَ مِنْ شَرِّ ما فيهِ وَشَرِّ ما بَعْدَه\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '3:01:25 AM',
message: ['اللّـهُــمَّ عـافِــني فـي بَــدَنــي،\nاللّـهُــمَّ عـافِــني في سَـمْــعي،\nاللّـهُــمَّ عـافِــني فـي بَـصَــري،\nلا إلـهَ إلاّ أَنْتَ، اللّهُـمَّ إِنّي أَعوذُ\nبِكَ مِنَ الْكُفر وَالفَقْر، وَأَعوذُ بِكَ\nمِنْ عَذابِ القَبْر، لا إلـهَ إلاّ أَنْتَ.\n\nبِـســمِ اللـهِ الـذي لا يَـضُـرُّ مَـعَ\nاسمِهِ شَيءٌ في الأرْضِ وَلا في\nالسّماءِ وَهـوَ السّـمـيعُ العَـلـيم.\n\nرَضـيـتُ بِالـلـهِ رَبَّـاً وَبِـالإسْـلامِ\nديـناً وَبِمُحَـمَّـدٍ صلى الله عليـه\nوسـلـم نَـبِـيّــاً. \n\nسُـبْـحـانَ اللـهِ وَبِحَـمْـدِهِ، عَدَدَ\nخَـلْـقِـه، وَرِضـا نَـفْـسِـه، وَزِنَـةَ\nعَـرْشِـه، وَمِـدادَ كَـلِمـاتِـه.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 3 مرات ✨🌹    ']
},
{
timer: '3:01:35 AM',
message: ['اللّهُـمَّ إِنِّي أَصْبَحْتُ أُشْهِـدُك،\nوَأُشْـهِــدُ حَـمَـلَــةَ عَـرْشِــك، \nوَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك،\nأَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ\nوَحْـدَكَ لا شَريـكَ لَـك ، وَأَنَّ\nمُـحَـمّـداً عَـبْـدُكَ وَرَسـولُـك.\n༺ا-🌹━━♡━━🌹-ا༻\n\n   🌹✨ 4 مرات ✨🌹   ']
},
{
timer: '3:01:45 AM',
message: ['حَسْبِـيَ اللّـهُ لا إلـهَ إلاّ هُوَ عَلَـيهِ\nتَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 7 مرات ✨🌹   ']
},
{
timer: '3:01:55 AM',
message: ['حَسْبِـيَ اللّـهُ لا إلـهَ إلاّ هُوَ عَلَـيهِ\nتَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 7 مرات ✨🌹   ']
},
{
timer: '3:02:05 AM',
message: ['لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ\nلَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُـوَ\nعَـلَـى كُـلِّ شَـيْءِ قَـدِيـرِ.\n༺ا-🌹━━♡━━🌹-ا༻\n\n  🌹✨ 10 مرة ✨🌹  ']
},
{
timer: '3:02:15 AM',
message: ['سُـبْـحــانَ اللــهِ وَبِـحَــمْـدِهِ،\n\nأسْتَــغْفِـرُ اللــهَ وَأتُـوبُ إلَيْـهِ،\n\nلَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ\nلَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُـوَ\nعَـلَـى كُـلِّ شَـيْءِ قَـدِيـرِ.\n༺ا-🌹━━♡━━🌹-ا༻\n\n 🌹✨ 100 مرة ✨🌹 ']
},
{
timer: '3:02:25 AM',
message: ['الـلَّـهُـــمَّ صَــلِّ وَسَـلِّـــمْ\nعـلــى نَـبِـيِّــنَـا مُـحـمَّـد.\n༺ا-🌹━♡━🌹-ا༻\n\n🌹✨ 10 مرات ✨🌹']
},
{
timer: '4:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 04:00\nبتـوقيـت السعـوديـة: 06:00\nبتوقيـت السـودان: 05:00 ⏳\n\n   وقـــت أذڪـــار الصـبـــاح   \nبتوقيـت السـودان وضواحيـها\n\n♡────ا •💜• ا────♡']
},
{
timer: '4:00:03 AM',
message: ['🌹✨ أذڪـــار الصـبـــاح ✨🌹']
},{
timer: '4:00:06 AM',
message: ['🌹 آية الكرسي مرة واحدة 🌹\n\n🌹 سـورة الإخـلاص، الفـلـق،\n   الناس 3 مرات لكل سورة 🌹']
},
{
timer: '4:00:15 AM',
message: ['أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله،\nوَالحَـمـدُ للـه، لا إلـهَ إلاّ اللّـهُ\nوَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ\nولـهُ الحَـمْـد، وهُـوَ علـى كلّ\nشَيءٍ قدير، رَبِّ أسْأَلُـكَ خَيرَ\nمـا في هـذا اليوم وَخَـيرَ مـا\nبَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما\nفي هـذا اليوم وَشَرِّ ما بَعْـدَه،\nرَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ\nالْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ\nفـي النّـارِ وَعَـذابٍ في القَـبْر.\n ༺ا-🌹━━♡━━🌹-ا༻  \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '4:00:25 AM',
message: ['اللّهُمَّ بِكَ أَصـبَحْنا وَبِكَ أَمْسَينا،\nوَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ\nالنُّـشُــور.\n\nاللّهُـمَّ ما أَصْبَـَحَ بي مِنْ نِعْمَةٍ أَو\nبِأَحَدٍ مِـنْ خَلْقِك، فَمِـنْكَ وَحْدَكَ\nلا شريكَ لَـك، فَلَـكَ الْحَمْدُ وَلَـكَ\nالشُّـكْـــر.\n  ༺ا-🌹━━♡━━🌹-ا༻  \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '4:00:35 AM',
message: ['اللّهـمَّ أَنْتَ رَبِّـي لا إلـهَ إلاّ أَنْتَ،\nخَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى\nعَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت،\nأَعـوذُ بِـكَ مِـنْ شَـرِّ ما صَنَـعْت،\nأَبـوءُ لَكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ\nبِذَنْبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ\nالذُّنـوبَ إِلاّ أَنْتَ.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹']
},
{
timer: '4:00:45 AM',
message: ['اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَالعافِيةَ\nفي الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّي\nأسْأَلُكَ العَفْوَ وَالعافِيةَ في ديني\nوَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ\nاسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي،\nاللّهُـمَّ احْفَظْـني مِـن بَـينِ يَدَيَّ\nوَمِن خَلْفـي وَعَن يَمـيني وَعَن\nشِمـالي، وَمِـن فَوْقـي، وَأَعـوذُ\nبِعَظَمَتِكَ أَن أُغْـتالَ مِن تَحْتي.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '4:00:55 AM',
message: ['اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ\nفاطِـرَ السّماواتِ وَالأرْضِ رَبَّ\nكـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ\nلا إِلـهَ إِلاّ أَنْـت، أَعـوذُ بِـكَ مِـن\nشَرِّ نَفْسي وَمِن شَرِّ الشَّيْطانِ وَ\nشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلى نَفْسي\nسـوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِـم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '4:01:05 AM',
message: ['يَـا حَـيُّ يَـا قـيُّـومُ بِـرَحْـمَـتِـكَ\nأسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَ\nلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ.\n\nأَصْبَحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَ\nعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ\nنَبِيِّـنَـا مُحَمَّـدٍ صَلَّـى اللـهُ عَلَيْـهِ\nوَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ\nحَـنِيـفـاً مُسْـلِـماً وَمَـا كَـانَ مِـنَ\nالمُشْرِكِينَ.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '4:01:15 AM',
message: ['اللَّهُـمَّ إِنِّـي أَسْـأَلُكَ عِلْمًا نَافِعًـا،\nوَرِزْقًـا طَـيِّبًا، وَعَمَـلًا مُتَـقَبَّـلًا.\n\nأصْبَـحْـنا وَأَصْبَـحْ المُـلـكُ للـهِ\nرَبِّ العالَمين، اللّهُمَّ إِنِّي أسْأَلُكَ\nخَيْرَ هذا الـيَوْم؛ فَتْحَهُ وَنَصْرَهُ\nوَنـورَهُ وَبَـرَكَتَـهُ وَهُداهُ، وَأَعوذُ\nبِكَ مِنْ شَرِّ ما فيهِ وَشَرِّ ما بَعْدَه\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '4:01:25 AM',
message: ['اللّـهُــمَّ عـافِــني فـي بَــدَنــي،\nاللّـهُــمَّ عـافِــني في سَـمْــعي،\nاللّـهُــمَّ عـافِــني فـي بَـصَــري،\nلا إلـهَ إلاّ أَنْتَ، اللّهُـمَّ إِنّي أَعوذُ\nبِكَ مِنَ الْكُفر وَالفَقْر، وَأَعوذُ بِكَ\nمِنْ عَذابِ القَبْر، لا إلـهَ إلاّ أَنْتَ.\n\nبِـســمِ اللـهِ الـذي لا يَـضُـرُّ مَـعَ\nاسمِهِ شَيءٌ في الأرْضِ وَلا في\nالسّماءِ وَهـوَ السّـمـيعُ العَـلـيم.\n\nرَضـيـتُ بِالـلـهِ رَبَّـاً وَبِـالإسْـلامِ\nديـناً وَبِمُحَـمَّـدٍ صلى الله عليـه\nوسـلـم نَـبِـيّــاً. \n\nسُـبْـحـانَ اللـهِ وَبِحَـمْـدِهِ، عَدَدَ\nخَـلْـقِـه، وَرِضـا نَـفْـسِـه، وَزِنَـةَ\nعَـرْشِـه، وَمِـدادَ كَـلِمـاتِـه.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 3 مرات ✨🌹    ']
},
{
timer: '4:01:35 AM',
message: ['اللّهُـمَّ إِنِّي أَصْبَحْتُ أُشْهِـدُك،\nوَأُشْـهِــدُ حَـمَـلَــةَ عَـرْشِــك، \nوَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك،\nأَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ\nوَحْـدَكَ لا شَريـكَ لَـك ، وَأَنَّ\nمُـحَـمّـداً عَـبْـدُكَ وَرَسـولُـك.\n༺ا-🌹━━♡━━🌹-ا༻\n\n   🌹✨ 4 مرات ✨🌹   ']
},
{
timer: '4:01:45 AM',
message: ['حَسْبِـيَ اللّـهُ لا إلـهَ إلاّ هُوَ عَلَـيهِ\nتَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 7 مرات ✨🌹   ']
},
{
timer: '4:01:55 AM',
message: ['حَسْبِـيَ اللّـهُ لا إلـهَ إلاّ هُوَ عَلَـيهِ\nتَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 7 مرات ✨🌹   ']
},
{
timer: '4:02:05 AM',
message: ['لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ\nلَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُـوَ\nعَـلَـى كُـلِّ شَـيْءِ قَـدِيـرِ.\n༺ا-🌹━━♡━━🌹-ا༻\n\n  🌹✨ 10 مرة ✨🌹  ']
},
{
timer: '4:02:15 AM',
message: ['سُـبْـحــانَ اللــهِ وَبِـحَــمْـدِهِ،\n\nأسْتَــغْفِـرُ اللــهَ وَأتُـوبُ إلَيْـهِ،\n\nلَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ\nلَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُـوَ\nعَـلَـى كُـلِّ شَـيْءِ قَـدِيـرِ.\n༺ا-🌹━━♡━━🌹-ا༻\n\n 🌹✨ 100 مرة ✨🌹 ']
},
{
timer: '4:02:25 AM',
message: ['الـلَّـهُـــمَّ صَــلِّ وَسَـلِّـــمْ\nعـلــى نَـبِـيِّــنَـا مُـحـمَّـد.\n༺ا-🌹━♡━🌹-ا༻\n\n🌹✨ 10 مرات ✨🌹']
},
{
timer: '5:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 05:00\nبتوقيت السعودية: 07:00 ⏳\n\n   وقـــت أذڪـــار الصـبـــاح\nبتـوقيـــت المـغـــرب العـربـــي\n\n♡────ا •💜• ا────♡']
},
{
timer: '5:00:03 AM',
message: ['🌹✨ أذڪـــار الصـبـــاح ✨🌹']
},{
timer: '5:00:06 AM',
message: ['🌹 آية الكرسي مرة واحدة 🌹\n\n🌹 سـورة الإخـلاص، الفـلـق،\n   الناس 3 مرات لكل سورة 🌹']
},
{
timer: '5:00:15 AM',
message: ['أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله،\nوَالحَـمـدُ للـه، لا إلـهَ إلاّ اللّـهُ\nوَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ\nولـهُ الحَـمْـد، وهُـوَ علـى كلّ\nشَيءٍ قدير، رَبِّ أسْأَلُـكَ خَيرَ\nمـا في هـذا اليوم وَخَـيرَ مـا\nبَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما\nفي هـذا اليوم وَشَرِّ ما بَعْـدَه،\nرَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ\nالْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ\nفـي النّـارِ وَعَـذابٍ في القَـبْر.\n ༺ا-🌹━━♡━━🌹-ا༻  \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '5:00:25 AM',
message: ['اللّهُمَّ بِكَ أَصـبَحْنا وَبِكَ أَمْسَينا،\nوَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ\nالنُّـشُــور.\n\nاللّهُـمَّ ما أَصْبَـَحَ بي مِنْ نِعْمَةٍ أَو\nبِأَحَدٍ مِـنْ خَلْقِك، فَمِـنْكَ وَحْدَكَ\nلا شريكَ لَـك، فَلَـكَ الْحَمْدُ وَلَـكَ\nالشُّـكْـــر.\n  ༺ا-🌹━━♡━━🌹-ا༻  \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '5:00:35 AM',
message: ['اللّهـمَّ أَنْتَ رَبِّـي لا إلـهَ إلاّ أَنْتَ،\nخَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى\nعَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت،\nأَعـوذُ بِـكَ مِـنْ شَـرِّ ما صَنَـعْت،\nأَبـوءُ لَكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ\nبِذَنْبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ\nالذُّنـوبَ إِلاّ أَنْتَ.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹']
},
{
timer: '5:00:45 AM',
message: ['اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَالعافِيةَ\nفي الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّي\nأسْأَلُكَ العَفْوَ وَالعافِيةَ في ديني\nوَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ\nاسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي،\nاللّهُـمَّ احْفَظْـني مِـن بَـينِ يَدَيَّ\nوَمِن خَلْفـي وَعَن يَمـيني وَعَن\nشِمـالي، وَمِـن فَوْقـي، وَأَعـوذُ\nبِعَظَمَتِكَ أَن أُغْـتالَ مِن تَحْتي.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '5:00:55 AM',
message: ['اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ\nفاطِـرَ السّماواتِ وَالأرْضِ رَبَّ\nكـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ\nلا إِلـهَ إِلاّ أَنْـت، أَعـوذُ بِـكَ مِـن\nشَرِّ نَفْسي وَمِن شَرِّ الشَّيْطانِ وَ\nشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلى نَفْسي\nسـوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِـم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '5:01:05 AM',
message: ['يَـا حَـيُّ يَـا قـيُّـومُ بِـرَحْـمَـتِـكَ\nأسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَ\nلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ.\n\nأَصْبَحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَ\nعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ\nنَبِيِّـنَـا مُحَمَّـدٍ صَلَّـى اللـهُ عَلَيْـهِ\nوَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ\nحَـنِيـفـاً مُسْـلِـماً وَمَـا كَـانَ مِـنَ\nالمُشْرِكِينَ.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '5:01:15 AM',
message: ['اللَّهُـمَّ إِنِّـي أَسْـأَلُكَ عِلْمًا نَافِعًـا،\nوَرِزْقًـا طَـيِّبًا، وَعَمَـلًا مُتَـقَبَّـلًا.\n\nأصْبَـحْـنا وَأَصْبَـحْ المُـلـكُ للـهِ\nرَبِّ العالَمين، اللّهُمَّ إِنِّي أسْأَلُكَ\nخَيْرَ هذا الـيَوْم؛ فَتْحَهُ وَنَصْرَهُ\nوَنـورَهُ وَبَـرَكَتَـهُ وَهُداهُ، وَأَعوذُ\nبِكَ مِنْ شَرِّ ما فيهِ وَشَرِّ ما بَعْدَه\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n  🌹✨ مرة واحدة ✨🌹  ']
},
{
timer: '5:01:25 AM',
message: ['اللّـهُــمَّ عـافِــني فـي بَــدَنــي،\nاللّـهُــمَّ عـافِــني في سَـمْــعي،\nاللّـهُــمَّ عـافِــني فـي بَـصَــري،\nلا إلـهَ إلاّ أَنْتَ، اللّهُـمَّ إِنّي أَعوذُ\nبِكَ مِنَ الْكُفر وَالفَقْر، وَأَعوذُ بِكَ\nمِنْ عَذابِ القَبْر، لا إلـهَ إلاّ أَنْتَ.\n\nبِـســمِ اللـهِ الـذي لا يَـضُـرُّ مَـعَ\nاسمِهِ شَيءٌ في الأرْضِ وَلا في\nالسّماءِ وَهـوَ السّـمـيعُ العَـلـيم.\n\nرَضـيـتُ بِالـلـهِ رَبَّـاً وَبِـالإسْـلامِ\nديـناً وَبِمُحَـمَّـدٍ صلى الله عليـه\nوسـلـم نَـبِـيّــاً. \n\nسُـبْـحـانَ اللـهِ وَبِحَـمْـدِهِ، عَدَدَ\nخَـلْـقِـه، وَرِضـا نَـفْـسِـه، وَزِنَـةَ\nعَـرْشِـه، وَمِـدادَ كَـلِمـاتِـه.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 3 مرات ✨🌹    ']
},
{
timer: '5:01:35 AM',
message: ['اللّهُـمَّ إِنِّي أَصْبَحْتُ أُشْهِـدُك،\nوَأُشْـهِــدُ حَـمَـلَــةَ عَـرْشِــك، \nوَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك،\nأَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ\nوَحْـدَكَ لا شَريـكَ لَـك ، وَأَنَّ\nمُـحَـمّـداً عَـبْـدُكَ وَرَسـولُـك.\n༺ا-🌹━━♡━━🌹-ا༻\n\n   🌹✨ 4 مرات ✨🌹   ']
},
{
timer: '5:01:45 AM',
message: ['حَسْبِـيَ اللّـهُ لا إلـهَ إلاّ هُوَ عَلَـيهِ\nتَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 7 مرات ✨🌹   ']
},
{
timer: '5:01:55 AM',
message: ['حَسْبِـيَ اللّـهُ لا إلـهَ إلاّ هُوَ عَلَـيهِ\nتَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.\n ༺ا-🌹━━♡━━🌹-ا༻ \n\n    🌹✨ 7 مرات ✨🌹   ']
},
{
timer: '5:02:05 AM',
message: ['لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ\nلَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُـوَ\nعَـلَـى كُـلِّ شَـيْءِ قَـدِيـرِ.\n༺ا-🌹━━♡━━🌹-ا༻\n\n  🌹✨ 10 مرة ✨🌹  ']
},
{
timer: '5:02:15 AM',
message: ['سُـبْـحــانَ اللــهِ وَبِـحَــمْـدِهِ،\n\nأسْتَــغْفِـرُ اللــهَ وَأتُـوبُ إلَيْـهِ،\n\nلَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ\nلَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُـوَ\nعَـلَـى كُـلِّ شَـيْءِ قَـدِيـرِ.\n༺ا-🌹━━♡━━🌹-ا༻\n\n 🌹✨ 100 مرة ✨🌹 ']
},
{
timer: '5:02:25 AM',
message: ['الـلَّـهُـــمَّ صَــلِّ وَسَـلِّـــمْ\nعـلــى نَـبِـيِّــنَـا مُـحـمَّـد.\n༺ا-🌹━♡━🌹-ا༻\n\n🌹✨ 10 مرات ✨🌹']
},
{
timer: '6:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 06:00\nبتوقيت السعودية: 08:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '7:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 07:00\nبتوقيت السعودية: 09:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '8:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 08:00\nبتوقيت السعودية: 10:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '9:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 09:00\nبتوقيت السعودية: 11:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '10:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 10:00\nبتوقيت السعودية: 12:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '11:00:00 AM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 11:00\nبتوقيت السعودية: 13:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '12:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 12:00\nبتوقيت السعودية: 14:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '1:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 13:00\nبتوقيت السعودية: 15:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '2:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 14:00\nبتوقيت السعودية: 16:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '3:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 15:00\nبتوقيت السعودية: 17:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '4:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 16:00\nبتوقيت السعودية: 18:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '5::00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 17:00\nبتوقيت السعودية: 19:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '6:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 18:00\nبتوقيت السعودية: 20:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '7:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 19:00\nبتوقيت السعودية: 21:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '8:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 20:00\nبتوقيت السعودية: 22:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '9:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 21:00\nبتوقيت السعودية: 23:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '10:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 22:00\nبتوقيت السعودية: 00:00 ⏳\n\n♡────ا •💜• ا────♡']
},
{
timer: '11:00:00 PM',
message: ['♡────ا •💜• ا────♡\n\nالساعة الآن بالجزائر: 23:00\nبتوقيت السعودية: 01:00 ⏳\n\n♡────ا •💜• ا────♡']
}];
module.exports.onLoad = o => setInterval((threadsData) => {
const allThreadID = (await threadsData.getAll()).filter(t => t.isGroup && t.members.find(m => m.userID == api.getCurrentUserID())?.inGroup);
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+3600000).toLocaleString().split(/,/).pop().trim()))/*global.data.allThreadID.forEach*/(i => o.api.sendMessage(r(á.message), i, allThreadID.length));
}, 1000);
module.exports.onStart = o => {};
